{
  "title": "NANO-9",
  "date": "2025-01-10",
  "excerpt": "Portafolio de alta gama impulsado por Astro, que muestra sitios web premium y experiencias digitales con un diseño de movimiento refinado e interacción. Utiliza animaciones impulsadas por GSAP, un control de cursor personalizado y un flujo de contacto elegante para reflejar estéticas de marca de lujo.",
  "images": [
    {
      "src": "src/assets/projects/nano-studio-1.png",
      "alt": "NANO-9 Interactive Hero and Preloader"
    },
    {
      "src": "src/assets/projects/nano-studio-2.png",
      "alt": "NANO-9 Minimal Slider and Project Showcase"
    }
  ],
  "liveLink": "https://www.nanostudio.pro/",
  "colors": "#98AEEB",
  "techStack": [
    {
      "title": "Astro",
      "link": "https://astro.build/"
    },
    {
      "title": "GSAP (Motion Design)",
      "link": "https://greensock.com/gsap/"
    },
    {
      "title": "Tailwind CSS v4",
      "link": "https://tailwindcss.com/"
    },
    {
      "title": "TypeScript",
      "link": "https://www.typescriptlang.org"
    },
    {
      "title": "Resend (Email API)",
      "link": "https://resend.com/"
    }
  ],
  "testimonial": null,
  "challenge": "Desarrollar una experiencia de usuario que simulara la estética de lujo y movimiento refinado de las agencias de diseño de alta gama, manteniendo al mismo tiempo un rendimiento excelente. El desafío clave fue orquestar animaciones complejas impulsadas por GSAP (preloader, slider, revelación de texto con SplitText) y gestionar un flujo de correo electrónico seguro y limpio usando Astro Actions.",
  "solution": "Se construyó la plataforma utilizando Astro para la velocidad estática y se integró GSAP con `CustomEase` y `SplitText` para manejar todas las interacciones de movimiento de forma precisa. El diseño se centró en un 'Minimal Slider' con navegación por rueda/touch, y se implementó un flujo de contacto limpio utilizando Astro Actions y la API de Resend para el envío seguro de correos electrónicos.",
  "comingSoon": false,
  "counterpartId": "en/nano-studio"
}
