{
  "title": "YogIN",
  "date": "2025-04-10",
  "excerpt": "SaaS innovador para estudiantes y profesores de yoga que facilita la creación de eventos, clases y perfiles personalizados, con funcionalidades de pago y suscripciones para análisis y mejora continua.",
  "images": [
    {
      "src": "src/assets/projects/yogin-1.webp",
      "alt": "Yogi Website"
    },
    {
      "src": "src/assets/projects/yogin-2.webp",
      "alt": "Yogi Website"
    }
  ],
  "liveLink": "https://yog-in.es",
  "colors": "#d2944a",
  "techStack": [
    {
      "title": "React",
      "link": "https://reactjs.org/"
    },
    {
      "title": "Bit",
      "link": "https://bit.dev/"
    },
    {
      "title": "Node.js & Express",
      "link": "https://nodejs.org/, https://expressjs.com/"
    },
    {
      "title": "Passport",
      "link": "http://www.passportjs.org/"
    },
    {
      "title": "Tailwind CSS",
      "link": "https://tailwindcss.com/"
    }
  ],
  "testimonial": {
    "name": "Victoria González López",
    "quote": "La experiencia y dedicación de Adrian ayudó a transformar nuestra visión en realidad. La plataforma que construyó no solo optimizó nuestras operaciones sino que creó una experiencia fluida para nuestra comunidad de yoga.",
    "role": "Propietaria de Yog-IN"
  },
  "challenge": "Crear una plataforma SaaS moderna para estudiantes y profesores de yoga que permita gestionar eventos, clases, perfiles y pagos, con funcionalidades avanzadas de filtrado y suscripciones para análisis de desempeño, manteniendo una arquitectura segura y escalable.",
  "solution": "Utilizamos React con Bit para construir una interfaz modular y reutilizable, junto con Node.js y Express en el backend para una API robusta. Implementamos Passport para autenticación segura, Tailwind CSS para un diseño limpio y responsive, y ChatGM para mejorar la experiencia UI. También integramos Tankstack para optimizar las llamadas API, garantizando rendimiento y escalabilidad.",
  "comingSoon": false,
  "counterpartId": "en/yogin"
}
